[
{"type":"header","version":"5.2.0","comment":"Export to JSON plugin for PHPMyAdmin"},
{"type":"database","name":"links"},
{"type":"table","name":"links","database":"links","data":
[
{"Id":"1","name":"w3schools","image":"image001.png","description_hu":"A W3Schools egy ingyenes online oktatási platform, amely széles körű információkkal és útmutatókkal szolgál a webfejlesztés és programozás területén. A weboldal tartalmaz tanfolyamokat és részletes leírásokat a HTML, CSS, JavaScript, PHP és más népszerű programozási nyelvekkel kapcsolatban. Emellett gyakorlati példák, kódrészletek és érthető magyarázatok segítségével könnyedén elsajátíthatók a különböző technikák és fejlesztési módszerek. A W3Schools a kezdőknek és tapasztalt fejlesztőknek egyaránt kiváló forrás, hogy felfedezzék és fejlesszék programozói képességeiket.","description_en":"W3Schools is a free online educational platform that provides extensive information and tutorials on web development and programming. The website offers courses and detailed explanations on HTML, CSS, JavaScript, PHP, and other popular programming languages. It provides practical examples, code snippets, and clear explanations to easily grasp various techniques and development methods. W3Schools is an excellent resource for beginners and experienced developers alike to explore and enhance their programming skills.","link":"https:\/\/www.w3schools.com\/"},
{"Id":"2","name":"CSS-tricks","image":"image002.png","description_hu":"A CSS-Tricks egy informatív és közösségi alapú weboldal, amely a CSS (Cascading Style Sheets) és webfejlesztéssel kapcsolatos témákat fed. Itt találhatók cikkek, oktatóanyagok, tippek és trükkök a modern webdesignhoz és CSS-hoz kapcsolódó legújabb technikákról és eszközökről. A közösség tagjai megoszthatják tapasztalataikat, problémáikat, és válaszokat kaphatnak a fejlesztői közösségtől. Emellett a CSS-Tricks fórumot, podcasteket, videókat és interaktív példákat is kínál, hogy segítse a látogatókat a fejlesztési folyamatban és a kreatív CSS megoldásokban.","description_en":"CSS-Tricks is an informative and community-driven website that covers topics related to CSS (Cascading Style Sheets) and web development. It features articles, tutorials, tips, and tricks about the latest techniques and tools in modern web design and CSS. Community members can share their experiences, discuss challenges, and receive answers from the developer community. In addition, CSS-Tricks offers a forum, podcasts, videos, and interactive code examples to assist visitors in the development process and creative CSS solutions.","link":"https:\/\/css-tricks.com\/"},
{"Id":"3","name":"Bootstrap","image":"image003.png","description_hu":"A Bootstrap egy ingyenes és nyílt forráskódú CSS keretrendszer, amely segítséget nyújt a webfejlesztőknek a reszponzív, mobilbarát weboldalak gyors létrehozásában. A Bootstrap komponenseket, stílusokat és JavaScript alapú interakciókat tartalmaz, amelyek könnyedén testre szabhatók és használhatók a projekt igényeinek megfelelően. A keretrendszer egyszerűen használható, jól dokumentált és széles körben támogatott a webfejlesztői közösségben. A Bootstrap különféle előre elkészített sablonokat és elemeket kínál, amelyek lehetővé teszik a gyors és hatékony weboldalfejlesztést.","description_en":"Bootstrap is a free and open-source CSS framework that helps web developers quickly build responsive and mobile-friendly websites. It provides a collection of components, styles, and JavaScript-based interactions that can be easily customized and used to fit the needs of a project. The framework is user-friendly, well-documented, and widely supported within the web development community. Bootstrap offers various pre-designed templates and elements that enable fast and efficient website development.","link":"https:\/\/getbootstrap.com\/"},
{"Id":"4","name":"Google font és icon készlet ","image":"image004.png","description_hu":"A Google Fonts egy ingyenes online szolgáltatás, amely lehetővé teszi a webfejlesztők számára, hogy könnyedén hozzáadjanak különböző betűtípusokat (fontokat) weboldalaikhoz. A Google Fonts hatalmas választékot kínál több száz betűtípussal, amelyek közül választhatunk, és amelyek széles körben kompatibilisek a legtöbb modern webböngészővel. A betűtípusok használata egyszerű, csak be kell illeszteni a megfelelő kódrészletet a weboldal HTML kódjába. Az így kiválasztott betűtípusok hozzájárulhatnak a weboldalak esztétikájához és olvashatóságához.\r\n\r\nA Google Icons egy ingyenes ikonkönyvtár, amely számos különféle ikont kínál webfejlesztőknek és tervezőknek. Az ikonok kategóriákba vannak rendezve, és könnyen használhatók a weboldalakon, alkalmazásokban és más projektekben. A Google Icons használata egyszerű, csak meg kell találni a kívánt ikont, és hozzá kell adni a weboldal vagy alkalmazás kódjához. Az ikonok lehetővé teszik a felhasználók számára, hogy vizuálisan érthető és vonzó módon kommunikáljanak különféle funkciókat vagy tartalmakat.","description_en":"Google Fonts is a free online service that allows web developers to easily add various fonts to their websites. Google Fonts offers a vast collection of hundreds of font options to choose from, which are widely compatible with most modern web browsers. Using these fonts is simple; you just need to insert the appropriate code snippet into the HTML code of your website. The selected fonts can contribute to the aesthetics and readability of web pages, enhancing the overall design and user experience.\r\n\r\nGoogle Icons is a free icon library that offers a wide range of diverse icons for web developers and designers. The icons are categorized and can be easily used in websites, applications, and other projects. Utilizing Google Icons is straightforward; you just need to find the desired icon and add it to the code of your website or application. Icons enable users to communicate various functionalities or content in a visually understandable and appealing manner.","link":"https:\/\/fonts.google.com\/"},
{"Id":"5","name":"Font Awesome","image":"image005.png","description_hu":"A Font Awesome egy népszerű ikonkönyvtár és eszközkészlet, amely számos különféle ikont és vektorgrafikát kínál webfejlesztőknek és tervezőknek. A Font Awesome ikonokat tartalmaz a legkülönfélébb kategóriákban, például fontosabb társadalmi média ikonok, navigációs ikonok, média és szórakozás ikonok, valamint sok más kategória. Az ikonok könnyen használhatók weboldalakon vagy alkalmazásokban, csak be kell illeszteni a megfelelő kódot vagy használni a Font Awesome CSS osztályait. A Font Awesome segít abban, hogy vizuálisan vonzó és egyedi megjelenést hozzon létre a projektekben.","description_en":"Font Awesome is a popular icon library and toolkit that provides a wide range of icons and vector graphics for web developers and designers. Font Awesome includes icons in various categories, such as essential social media icons, navigation icons, media and entertainment icons, and many others. The icons can be easily used in websites or applications by inserting the appropriate code or using Font Awesome's CSS classes. Font Awesome helps create visually appealing and unique appearances in projects, enhancing their overall design and user experience.","link":"https:\/\/fontawesome.com\/"},
{"Id":"6","name":"Stack Overflow","image":"image006.png","description_hu":"Stack Overflow egy ismert és népszerű kérdés-válasz alapú online közösség, amely a programozók és fejlesztők számára kínál segítséget és információt. A weboldalon a felhasználók kérdéseket tehetnek fel különféle programozási és szoftvertervezési témákban, és más közösségi tagok válaszolhatnak ezekre. A Stack Overflow gazdag tudástár és erőforrás a fejlesztők számára, ahol megtalálhatnak válaszokat a problémáikra és segítséget kaphatnak a projektek fejlesztésében.","description_en":"Stack Overflow is a well-known and popular question-and-answer-based online community that provides assistance and information to programmers and developers. On the website, users can ask questions on various programming and software design topics, and other community members can provide answers. Stack Overflow serves as a rich knowledge base and resource for developers, where they can find solutions to their problems and get help with their project development.","link":"https:\/\/stackoverflow.com\/"},
{"Id":"7","name":"Coolors","image":"image007.png","description_hu":"A Coolors.co egy online szolgáltatás, amely segít a felhasználóknak kiválasztani és létrehozni a tökéletes színpalettát. Ez a weboldal könnyen használható eszközöket kínál a színek felfedezéséhez, kombinálásához és testreszabásához. A Coolors.co lehetővé teszi a felhasználók számára, hogy létrehozzanak egyedi színpalettákat a véletlenszerű színkombinációk vagy a saját kreatív elképzelések alapján. Emellett a weboldal előre elkészített palettákat is tartalmaz, amelyek inspirációt nyújthatnak a tervezőknek és fejlesztőknek. A Coolors.co segít abban, hogy a színekkel kapcsolatos döntéseket könnyen és hatékonyan hozzuk meg a webdesign vagy más kreatív projektek során.","description_en":"Coolors.co is an online service that helps users select and create the perfect color palette. This website offers easy-to-use tools for exploring, combining, and customizing colors. Coolors.co allows users to generate unique color palettes based on random color combinations or their own creative ideas. Additionally, the website includes pre-made palettes that can serve as inspiration for designers and developers. Coolors.co aids in making color-related decisions easily and efficiently during web design or other creative projects.","link":"https:\/\/coolors.co\/"},
{"Id":"8","name":"Background remover","image":"image008.png","description_hu":"A Remove.bg egy online szolgáltatás, amely lehetővé teszi a felhasználók számára, hogy könnyedén eltávolítsák a képekről a hátteret. Ez a weboldal nagyon hasznos lehet grafikus tervezők, fotósok és átlagos felhasználók számára, akik szeretnék fókuszba helyezni a képeken található személyeket vagy tárgyakat, anélkül, hogy figyelmet kellene fordítaniuk a háttérre. A Remove.bg automatikusan észleli és kivágja a fő motívumot a képek hátteréből, és átlátszó háttérrel rendelkező PNG fájlként adja vissza. Ez gyors és hatékony módszer a professzionális megjelenést nyújtó képek létrehozásához.","description_en":"Remove.bg is an online service that allows users to easily remove the background from images. This website can be highly useful for graphic designers, photographers, and regular users who want to focus on the people or objects in their images without the distraction of the background. Remove.bg automatically detects and cuts out the main subject from the image background, returning it as a PNG file with a transparent background. This provides a quick and efficient method for creating professional-looking images.","link":"https:\/\/www.remove.bg\/"},
{"Id":"9","name":"SketchMyPic - Ceruza rajz converter","image":"image009.png","description_hu":"A SketchMyPic egy online szolgáltatás, amely lehetővé teszi a felhasználók számára, hogy a képeiket képként (rajzként) stilizálják. Ez a weboldal különleges effektusokat és algoritmusokat alkalmaz, hogy a képeket olyanra alakítsa, mintha kézzel rajzolták volna meg őket. A felhasználók egyszerűen feltölthetik a kívánt képet, és választhatnak a különböző rajzstílusok közül. A SketchMyPic átalakítja a képet, és visszaadja a rajzolt hatást, amely egyedi és kreatív megjelenést kölcsönöz a képeknek.","description_en":"SketchMyPic is an online service that allows users to stylize their images as sketches. This website applies special effects and algorithms to transform images to appear as if they were hand-drawn. Users can simply upload their desired image and choose from various drawing styles. SketchMyPic will then convert the image and provide it back with a sketched effect, giving the images a unique and creative appearance.","link":"https:\/\/sketchmypic.com"},
{"Id":"10","name":"CleanPNG","image":"image010.png\r\n","description_hu":"A CleanPNG egy online platform, ahol széles választékban találhatóak átlátszó hátterű PNG képek. Ez a weboldal nagyszerű forrás grafikus tervezők, webfejlesztők és szerkesztők számára, akiknek szükségük van minőségi PNG képekre, amelyek könnyen illeszthetők be a projektekbe. A CleanPNG-n gyorsan és egyszerűen lehet keresni a kívánt kategóriákban, mint például tárgyak, állatok, emberek, természet, ikonok és még sok más. Az átlátszó hátterű PNG képek könnyen beilleszthetők más képekhez vagy háttérbe, így tökéletesen illeszkednek a különböző kreatív projektekbe.","description_en":"CleanPNG is an online platform that offers a wide range of transparent background PNG images. This website serves as a great resource for graphic designers, web developers, and editors who need high-quality PNG images that can easily be incorporated into their projects. At CleanPNG, you can quickly and easily search for desired categories such as objects, animals, people, nature, icons, and more. The transparent background PNG images can be easily placed on top of other images or backgrounds, making them a perfect fit for various creative projects.","link":"https:\/\/www.cleanpng.com"},
{"Id":"11","name":"Pexels - Ingyenes fotó galéria","image":"image011.png","description_hu":"A Pexels egy ingyenes képfelhasználási platform, ahol számos kiváló minőségű és ingyenes képet találhatsz. Ez a weboldal kiváló forrás lehet webfejlesztők, grafikus tervezők, szerkesztők és más kreatív szakemberek számára, akik minőségi képeket szeretnének felhasználni a projektekben. A Pexels rengeteg témában kínál képeket, például táj, emberek, állatok, étel, munkahely, városi tájképek és még sok más. Az ingyenes képek keresése és letöltése egyszerű és könnyű a Pexels weboldalán, amely lehetővé teszi a felhasználók számára, hogy gyorsan megtalálják és felhasználják a számukra megfelelő képeket.","description_en":"Pexels is a free stock photo platform where you can find a wide range of high-quality and free images. This website can be an excellent resource for web developers, graphic designers, editors, and other creative professionals who are in need of quality images for their projects. Pexels offers a vast collection of images in various categories such as landscapes, people, animals, food, workplaces, cityscapes, and many more. Searching for and downloading the free images is easy and convenient on the Pexels website, allowing users to quickly find and utilize the images that suit their needs.","link":"https:\/\/www.pexels.com"},
{"Id":"12","name":"O-Dan  - Ingyenes fotó galéria","image":"image012.png","description_hu":"Az O-Dan egy online szolgáltatás, amely lehetővé teszi a felhasználók számára, hogy magas minőségű, ingyenes stock fotókat keressenek. Ez a weboldal remek forrás lehet olyan személyek számára, akik minőségi képeket keresnek különböző projektekhez, mint például webfejlesztés, grafikai tervezés, prezentációk és még sok más. Az O-Dan keresőfelülete lehetővé teszi a felhasználók számára, hogy könnyen megtalálják a kívánt témájú képeket. Az ingyenes stock fotók széles választékát kínálja, amelyeket a felhasználók szabadon felhasználhatnak a saját projektekben.","description_en":"O-Dan is an online service that allows users to search for high-quality free stock photos. This website can be a great resource for individuals in need of quality images for various projects such as web development, graphic design, presentations, and more. The search interface of O-Dan enables users to easily find images based on their desired topics. It offers a wide range of free stock photos that users can freely use in their own projects.","link":"https:\/\/o-dan.net"},
{"Id":"13","name":"Pinterest","image":"image013.png","description_hu":"A Pinterest egy közösségi hálózat és képmegosztó platform, ahol a felhasználók inspirációt gyűjthetnek és megoszthatnak különböző témákban, például divat, lakberendezés, gasztronómia, utazás, DIY projektek és sok más területen. Ez a weboldal számos képet, illusztrációt és designötletet kínál, amelyek segítségével felfedezheted a legújabb trendeket és ötleteket. A Pinteresten a felhasználók létrehozhatnak saját táblákat, menthetik és megoszthatják a kedvenc képeiket, valamint más felhasználók által létrehozott tartalmakat is felfedezhetnek. A Pinterest remek eszköz a kreatív ötletek felfedezéséhez és inspirációhoz.","description_en":"Pinterest is a social networking and image-sharing platform where users can gather and share inspiration on various topics such as fashion, home decor, food, travel, DIY projects, and many more. This website offers a wide range of images, illustrations, and design ideas to explore the latest trends and gather creative inspiration. On Pinterest, users can create their own boards, save and share their favorite images, as well as discover content created by other users. Pinterest is a great tool for discovering and finding inspiration for creative ideas.","link":"https:\/\/hu.pinterest.com\/"},
{"Id":"14","name":"Shutterstock","image":"image014.png","description_hu":"A Shutterstock egy stockfotók, vektorgrafikák, illusztrációk és videók széles választékát kínáló online platform. Ez a weboldal ideális forrás lehet grafikus tervezők, reklámügynökségek, újságírók és más kreatív szakemberek számára, akik minőségi tartalmakra van szükségük projektjeikhez. A Shutterstock hatalmas adatbázissal rendelkezik, amelyben több millió kép és videó található különböző témákban és stílusokban. A felhasználók egyszerűen kereshetnek a kívánt kulcsszavakkal, és megtalálhatják a számukra legmegfelelőbb tartalmakat. A Shutterstock előfizetési vagy kép alapú vásárlási opciókat kínál, amelyek lehetővé teszik a tartalmak letöltését és felhasználását a projektekben.","description_en":"Shutterstock is an online platform that offers a wide range of stock photos, vector graphics, illustrations, and videos. This website serves as an ideal resource for graphic designers, advertising agencies, journalists, and other creative professionals who are in need of high-quality content for their projects. Shutterstock has a massive database that contains millions of images and videos in various topics and styles. Users can easily search with desired keywords and find the most suitable content for their needs. Shutterstock provides subscription-based or image-based purchase options that allow users to download and use the content in their projects.","link":"https:\/\/www.shutterstock.com\/hu\r\n"},
{"Id":"15","name":"iStock","image":"image015.png","description_hu":"Az iStock egy online platform, ahol széles választékban találhatóak stockfotók, vektorgrafikák, illusztrációk és videók. Ez a weboldal remek forrás lehet grafikus tervezők, reklámügynökségek, újságírók és más kreatív szakemberek számára, akik prémium minőségű tartalmakra vágynak projektjeikhez. Az iStock egy nagy adatbázissal rendelkezik, amelyben több millió tartalom található különböző témákban és stílusokban. A felhasználók könnyedén kereshetnek a kívánt kulcsszavakkal vagy kategóriákkal, és megtalálhatják a számukra legmegfelelőbb tartalmakat. Az iStock lehetőséget nyújt előfizetéses csomagok vagy kredit alapú vásárlások számára, amelyek lehetővé teszik a tartalmak letöltését és felhasználását a projektekben.","description_en":"iStock is an online platform where you can find a wide range of stock photos, vector graphics, illustrations, and videos. This website serves as a great resource for graphic designers, advertising agencies, journalists, and other creative professionals who are in need of premium quality content for their projects. iStock has a large database that contains millions of content items in various topics and styles. Users can easily search using desired keywords or categories and find the most suitable content for their needs. iStock provides options for subscription packages or credit-based purchases, allowing users to download and use the content in their projects.","link":"https:\/\/www.istockphoto.com\/hu"},
{"Id":"16","name":"Canva","image":"image016.png","description_hu":"A Canva egy online grafikai tervezőplatform, amely lehetővé teszi a felhasználók számára, hogy egyszerűen és gyorsan készítsenek lenyűgöző vizuális tartalmakat. Ez a weboldal széles választékban kínál sablonokat, képeket, grafikákat és szövegeffekteket, amelyeket a felhasználók testreszabhatnak és kombinálhatnak a saját egyedi terveik létrehozásához. A Canva alkalmas prezentációk, infografikák, szórólapok, poszterek, közösségi média posztok és még sok más létrehozására. Az intuitív felhasználói felület és a könnyen kezelhető szerkesztő eszközök segítségével bárki kreatív projekteket hozhat létre a Canva segítségével, anélkül, hogy komoly grafikai ismeretekkel rendelkezne.","description_en":"Canva is an online graphic design platform that allows users to create stunning visual content quickly and easily. This website offers a wide range of templates, images, graphics, and text effects that users can customize and combine to create their own unique designs. Canva is suitable for creating presentations, infographics, flyers, posters, social media posts, and much more. With its intuitive user interface and user-friendly editing tools, anyone can create creative projects with Canva without the need for extensive graphic design knowledge.","link":"https:\/\/www.canva.com\/hu_hu\/"},
{"Id":"17","name":"ColorFish - Color Picker - Firefox Add-ons","image":"image017.png","description_hu":"A ColorFish egy online színválasztó eszköz, amely segít megtalálni és kiválasztani a kívánt színeket. Ez a weboldal kényelmesen használható a webfejlesztők, dizájnerek és bárki más számára, akik színekkel dolgoznak projektek során. A ColorFish lehetővé teszi a felhasználók számára, hogy a kívánt színt kiválasszák az egérrel vagy a színkódokkal, és megkapják a hozzá tartozó RGB, HEX vagy HSL értékeket. Emellett a ColorFish funkciókat kínál a színek kontrasztjának ellenőrzésére és a színpaletták létrehozására is. Ez a weboldal hasznos eszköz lehet, hogy pontosan megtaláld és kombináld a megfelelő színeket a tervezési projektedhez.","description_en":"ColorFish is an online color picker tool that helps you find and select the desired colors. This website is user-friendly and convenient for web developers, designers, and anyone else working with colors in their projects. ColorFish allows users to pick the desired color using the mouse or color codes and provides the corresponding RGB, HEX, or HSL values. Additionally, ColorFish offers features to check color contrast and create color palettes. This website can be a useful tool to accurately find and combine the right colors for your design projects.","link":"https:\/\/addons.mozilla.org\/en-US\/firefox\/addon\/colorfish-color-picker\/"},
{"Id":"18","name":"ColorPick Eyedropper - Crhome Add-ons","image":"image018.png","description_hu":"A ColorPick Eyedropper egy online színpipetta eszköz, amely lehetővé teszi a felhasználók számára, hogy pontosan kiválasszák és azonosítsák a kívánt színeket a weboldalakról vagy más digitális tartalmakról. Ez a weboldal kényelmesen használható webfejlesztők, dizájnerek és bárki más számára, aki színekkel dolgozik. A ColorPick Eyedropper egyszerűen telepíthető böngészőkiterjesztésként vagy alkalmazásként, és lehetővé teszi a felhasználók számára, hogy a kurzorral kattintva kiválasszák a színt a képernyőn, majd megkapják a hozzá tartozó RGB vagy HEX értékeket. Ez a színpipetta eszköz segít azonosítani és rögzíteni a különböző színeket, amelyeket később felhasználhatsz saját projektedben.","description_en":"ColorPick Eyedropper is an online color picker tool that allows users to precisely select and identify desired colors from web pages or other digital content. This website is convenient to use for web developers, designers, and anyone else working with colors. ColorPick Eyedropper can be easily installed as a browser extension or application, enabling users to click with the cursor to select the color on the screen and obtain the corresponding RGB or HEX values. This color picker tool helps identify and capture different colors that can be used later in your own projects.","link":"https:\/\/chrome.google.com\/webstore\/detail\/colorpick-eyedropper\/ohcpnigalekghcmgcdcenkpelffpdolg"},
{"Id":"19","name":"Paletton","image":"image019.png","description_hu":"A Paletton egy online színpaletta generátor, amely segít létrehozni harmónikus és vonzó színkombinációkat. Ez a weboldal kényelmes eszköz lehet webfejlesztők, dizájnerek és bárki más számára, aki kreatív projektek során színeket szeretne összeállítani. A Paletton lehetővé teszi a felhasználók számára, hogy kezdőszínt válasszanak, majd automatikusan generál harmonikus színösszeállításokat, például komplementer, hasonló vagy triádikus palettákat. Emellett a felhasználók testreszabhatják a színek fényerejét és telítettségét, és megkapják a hozzájuk tartozó RGB vagy HEX értékeket. A Paletton segítséget nyújt az izgalmas és összhangban lévő színkombinációk létrehozásában.","description_en":"Paletton is an online color palette generator that helps create harmonious and appealing color combinations. This website is a convenient tool for web developers, designers, and anyone else looking to assemble colors for creative projects. Paletton allows users to choose a base color and automatically generates harmonious color schemes such as complementary, analogous, or triadic palettes. Additionally, users can customize the brightness and saturation of the colors and obtain their corresponding RGB or HEX values. Paletton assists in creating exciting and cohesive color combinations.","link":"http:\/\/paletton.com"},
{"Id":"20","name":"Picular","image":"image020.png","description_hu":"A Picular egy online színkereső eszköz, amely segít megtalálni a kívánt színeket kulcsszavak vagy témák alapján. Ez a weboldal ideális választás lehet webfejlesztők, dizájnerek és bárki más számára, aki inspirációt keres a színválasztásához. A Picular egy intuitív keresőfelületet kínál, ahol a felhasználók beírhatnak egy kulcsszót vagy témát, és a rendszer válaszul olyan színpalettákat generál, amelyek kapcsolódnak a kereséshez. A paletták mellett a felhasználók megkapják a színkódokat és további információkat is, például a szín dominanciáját vagy a használt árnyalatokat. A Picular lehetővé teszi a kreatív színek felfedezését és használatát a projektekben.","description_en":"Picular is an online color search tool that helps you find desired colors based on keywords or topics. This website is an ideal choice for web developers, designers, and anyone else seeking inspiration for color selection. Picular offers an intuitive search interface where users can enter a keyword or topic, and the system generates color palettes related to the search. Along with the palettes, users receive color codes and additional information such as color dominance or the shades used. Picular allows for the exploration and utilization of creative colors in projects.","link":"https:\/\/picular.co\/"},
{"Id":"21","name":"Animista","image":"image021.png","description_hu":"Az Animista egy online animáció generátor, amely segít létrehozni és testreszabni különböző CSS alapú animációkat. Ez a weboldal ideális választás lehet webfejlesztők, dizájnerek és bárki más számára, aki érdeklődik az interaktív és mozgó elemek iránt a webhelyeken vagy az alkalmazásokban. Az Animista számos előre definiált animációs effektust kínál, amelyeket a felhasználók testre szabhatnak a sebesség, az időzítés és az átmenetek tekintetében. Emellett az Animista lehetővé teszi az animációkhoz tartozó CSS kódok letöltését, hogy könnyen be lehessen illeszteni a projektekbe. A weboldal intuitív felülettel rendelkezik, így bárki könnyedén létrehozhat egyedi animációkat a saját webhelyéhez vagy alkalmazásához.","description_en":"Animista is an online animation generator that helps create and customize various CSS-based animations. This website is an ideal choice for web developers, designers, and anyone else interested in interactive and moving elements on websites or applications. Animista offers a range of pre-defined animation effects that users can customize in terms of speed, timing, and transitions. Additionally, Animista allows for downloading the CSS code associated with the animations, making it easy to integrate them into projects. The website has an intuitive interface, enabling anyone to easily create unique animations for their own website or application.","link":"https:\/\/animista.net\/\r\n"},
{"Id":"22","name":" Dribbble","image":"image023.png\r\n","description_hu":"A Dribbble egy közösségi tervezői platform és portfóliószolgáltatás, amely lehetővé teszi a tervezők számára, hogy bemutassák munkáikat, inspirációt gyűjtsenek és kapcsolatokat építsenek más tervezőkkel és potenciális ügyfelekkel. Ez a weboldal kiváló választás lehet dizájnerek, illusztrátorok, webfejlesztők és más kreatív szakemberek számára, akik szeretnék megosztani és felfedezni kreatív projektekkel kapcsolatos munkákat. A Dribbble lehetővé teszi a felhasználók számára, hogy portfóliót hozzanak létre, tervezéseket töltsenek fel, közösségi visszajelzéseket kapjanak, és következő projektekhez ötleteket merítsenek másoktól. Emellett a Dribbble egy olyan platform, ahol a felhasználók munkát találhatnak vagy ajánlhatnak, valamint kapcsolatba léphetnek potenciális ügyfelekkel.","description_en":"Dribbble is a community design platform and portfolio service that allows designers to showcase their work, gather inspiration, and connect with other designers and potential clients. This website is an excellent choice for designers, illustrators, web developers, and other creative professionals who want to share and discover works related to creative projects. Dribbble enables users to create portfolios, upload designs, receive community feedback, and gain inspiration for their next projects from others. Additionally, Dribbble is a platform where users can find or post job opportunities and connect with potential clients.","link":"https:\/\/dribbble.com\/\r\n"},
{"Id":"23","name":"GremMedia - Sablonok","image":"image022.png","description_hu":"A GremMedia Sablonok oldala egy olyan része a GremMedia weboldalnak, ahol különböző előre készített sablonokat találhatsz. Ezek a sablonok segítenek gyorsan és hatékonyan létrehozni weboldalakat vagy más digitális tartalmakat. A GremMedia széles választékot kínál sablonokból, amelyek különböző iparágakhoz és célokhoz igazíthatók. Ezek a sablonok modern, letisztult és reszponzív kialakítással rendelkeznek, így alkalmazkodnak a különböző eszközökön és kijelzőméreteken való megjelenítéshez. A sablonok testreszabhatók, hogy illeszkedjenek a saját vállalkozásod vagy projektjeid arculatához. A GremMedia Sablonok oldala egy hatékony eszköz lehet, hogy gyorsan és professzionálisan hozzáférhetővé tegye a kész sablonokat és megkönnyítse a digitális tartalmak létrehozását.","description_en":"The GremMedia Templates page is a section of the GremMedia website where you can find various pre-designed templates. These templates help you quickly and efficiently create websites or other digital content. GremMedia offers a wide range of templates that can be customized to suit different industries and purposes. These templates have a modern, clean, and responsive design, adapting to display on different devices and screen sizes. The templates can be customized to fit the branding of your own business or projects. The GremMedia Templates page can be an effective tool to quickly and professionally access ready-made templates and facilitate the creation of digital content.","link":"https:\/\/gremmedia.hu\/sablonok"},
{"Id":"25","name":"Angular Cheat Sheet - DNC Magazine","image":"image024.png","description_hu":"Az Angular Cheat Sheet egy letölthető PDF dokumentum, amely segíti az Angular fejlesztőket a gyors hozzáférésben és referenciában a legfontosabb Angular konstrukciókhoz és funkciókhoz. Ez a Cheat Sheet a DNC Magazine által biztosított erőforrás, amely számos hasznos információt és kódmintákat tartalmaz az Angular keretrendszerhez. Az Angular Cheat Sheet segítséget nyújt az Angular fejlesztőknek a kódszerkesztés közben, hogy könnyen és hatékonyan használják a megfelelő direktívákat, komponenseket, szolgáltatásokat, és más Angular specifikus jellemzőket. Ez a letölthető dokumentum hasznos segédlet lehet az Angular fejlesztők számára, akik gyors hozzáférést szeretnének az Angular keretrendszer alapvető elemeihez.","description_en":"The Angular Cheat Sheet is a downloadable PDF document that helps Angular developers quickly access and reference the key Angular constructs and features. This Cheat Sheet is provided by DNC Magazine and contains various useful information and code samples related to the Angular framework. The Angular Cheat Sheet assists Angular developers during code editing to easily and efficiently utilize the appropriate directives, components, services, and other Angular-specific features. This downloadable document can serve as a helpful guide for Angular developers seeking quick access to the fundamental elements of the Angular framework.","link":"https:\/\/dncmagazine.blob.core.windows.net\/downloads\/AngularCheatSheet-DNCMagazine.pdf"},
{"Id":"26","name":"SheCodes Cheatsheets","image":"image025.png","description_hu":"A SheCodes Cheatsheets egy weboldal, amely különféle programozási nyelvekhez és technológiákhoz tartalmaz letölthető Cheat Sheet-eket. A Cheat Sheet-ek olyan rövid összefoglalók, amelyek segítenek a fejlesztőknek gyorsan áttekinteni és megjegyezni a nyelvi vagy keretrendszerbeli jellemzőket, szintaxisokat, parancsokat és egyéb információkat. A SheCodes Cheatsheets gyűjteménye különböző témákat tartalmaz, mint például HTML, CSS, JavaScript, Python, Git és sok más. Ezek a Cheat Sheet-ek hasznos segédeszközök lehetnek, amelyek gyors referenciát és segítséget nyújtanak a fejlesztés során.","description_en":"SheCodes Cheatsheets is a website that provides downloadable Cheat Sheets for various programming languages and technologies. Cheat Sheets are concise summaries that help developers quickly review and remember language or framework-specific features, syntax, commands, and other information. The SheCodes Cheatsheets collection covers various topics such as HTML, CSS, JavaScript, Python, Git, and many more. These Cheat Sheets can be useful tools that offer quick reference and assistance during development.","link":"https:\/\/cheatsheets.shecodes.io\/\r\n"},
{"Id":"27","name":" Bootstrap 5 Cheat Sheet - Classes Index","image":"image026.png","description_hu":"A Bootstrap 5 Cheat Sheet - Classes Index egy weboldal, amely részletesen bemutatja a Bootstrap 5 CSS osztályokat és azok funkcióit. Ez a Cheat Sheet segít a fejlesztőknek megismerni és megjegyezni a Bootstrap 5 keretrendszerben használható különböző osztályokat és azok jelentését. Az osztályok kategorizálva vannak, és számos példával és leírással vannak illusztrálva, hogy segítsenek a fejlesztőknek megérteni, hogyan alkalmazhatják őket a weboldalak stílusozásához és elrendezéséhez. Ez a Bootstrap 5 Cheat Sheet hasznos eszköz lehet azoknak, akik a Bootstrap keretrendszert használják és szeretnék jobban megismerni annak CSS osztályait és lehetőségeit.","description_en":"The Bootstrap 5 Cheat Sheet - Classes Index is a website that provides a detailed overview of the Bootstrap 5 CSS classes and their functionalities. This Cheat Sheet helps developers familiarize themselves with the various classes available in the Bootstrap 5 framework and their meanings. The classes are categorized and accompanied by numerous examples and descriptions to assist developers in understanding how they can be applied for styling and layout purposes on websites. This Bootstrap 5 Cheat Sheet can be a useful tool for those using the Bootstrap framework and wanting to gain a better understanding of its CSS classes and capabilities.","link":"https:\/\/bootstrapcreative.com\/resources\/bootstrap-5-cheat-sheet-classes-index\/"},
{"Id":"28","name":"Bootstrap Shuffle - Bootstrap Classes Reference","image":"image027.png","description_hu":"A Bootstrap Shuffle - Bootstrap Classes Reference egy weboldal, amely részletes információkat és példákat tartalmaz a Bootstrap keretrendszerben használható osztályokról. Ez a weboldal segítséget nyújt a fejlesztőknek abban, hogy megismerjék és megértjék a különböző Bootstrap osztályokat, és hogyan alkalmazhatják azokat a weboldalak kialakításában. Az osztályok részletesen le vannak írva, és számos példával és vizuális illusztrációval vannak bemutatva, hogy könnyen követhető legyen a használatuk. Az osztályok tematikusan csoportosítva vannak, és könnyen kereshetők a weboldalon. A Bootstrap Shuffle - Bootstrap Classes Reference egy hasznos erőforrás lehet minden Bootstrap fejlesztő számára, akik részletes információkat és gyakorlati példákat keresnek a Bootstrap osztályok használatához.","description_en":"Bootstrap Shuffle - Bootstrap Classes Reference is a website that provides detailed information and examples about the classes available in the Bootstrap framework. This website assists developers in understanding and utilizing the various Bootstrap classes for website design. The classes are thoroughly described and presented with multiple examples and visual illustrations to ensure easy comprehension of their usage. The classes are grouped thematically and are easily searchable on the website. Bootstrap Shuffle - Bootstrap Classes Reference can be a valuable resource for any Bootstrap developer seeking comprehensive information and practical examples for using Bootstrap classes.","link":"https:\/\/bootstrapshuffle.com\/classes\r\n"},
{"Id":"29","name":" Bootstrap Cheat Sheet - Theme Selection","image":"image028.png","description_hu":"A Bootstrap Cheat Sheet - Theme Selection egy weboldal, amely összefoglalja a Bootstrap keretrendszerben található osztályokat, komponenseket és egyéb jellemzőket. Ez a Cheat Sheet segít a fejlesztőknek gyorsan áttekinteni és megjegyezni a leggyakrabban használt Bootstrap osztályokat és lehetőségeket. Az osztályok és komponensek részletesen bemutatva vannak, és sok példával vannak illusztrálva, hogy segítsenek a fejlesztőknek megérteni, hogyan alkalmazhatják őket a webalkalmazásokban. A Bootstrap Cheat Sheet - Theme Selection további információkat is nyújt a Bootstrap témák használatához, hogy testreszabott és vizuálisan vonzó weboldalakat hozhassanak létre. Ez a Cheat Sheet egy praktikus eszköz lehet minden Bootstrap fejlesztő számára, aki hatékonyan szeretné használni a Bootstrap keretrendszert és kihasználni annak különféle lehetőségeit.","description_en":"Bootstrap Cheat Sheet - Theme Selection is a website that summarizes the classes, components, and other features available in the Bootstrap framework. This Cheat Sheet helps developers quickly review and remember the most commonly used Bootstrap classes and options. The classes and components are presented in detail and accompanied by numerous examples to assist developers in understanding how to apply them in web applications. The Bootstrap Cheat Sheet - Theme Selection also provides additional information on using Bootstrap themes to create customized and visually appealing websites. This Cheat Sheet can be a handy tool for any Bootstrap developer looking to effectively utilize the Bootstrap framework and leverage its various capabilities.","link":"https:\/\/bootstrap-cheatsheet.themeselection.com\/"},
{"Id":"30","name":"DeepL Translator","image":"image029.png","description_hu":"A DeepL Translator egy online fordítószolgáltatás, amely a mesterséges intelligencia alapú nyelvi technológiát alkalmazza a kiváló minőségű fordításokhoz. Ez a weboldal lehetővé teszi a felhasználók számára, hogy szövegeket, mondatokat vagy teljes dokumentumokat fordítsanak több mint 30 nyelvre. A DeepL Translator kiemelkedő pontossággal és természetes nyelvi feldolgozással rendelkezik, ami hozzájárul a megbízható és érthető fordításokhoz. A felhasználók egyszerűen beilleszthetik vagy begépelhetik a szöveget a weboldalra, majd kiválaszthatják a forrás- és célnyelvet a pontos fordítás eléréséhez. A DeepL Translator egy hatékony és megbízható eszköz a nyelvi kommunikáció támogatásához és a fordítási igények kielégítéséhez.","description_en":"DeepL Translator is an online translation service that utilizes artificial intelligence-based language technology to deliver high-quality translations. This website allows users to translate texts, sentences, or entire documents into over 30 languages. DeepL Translator offers exceptional accuracy and natural language processing, which contribute to reliable and understandable translations. Users can simply paste or type the text into the website and select the source and target language to achieve precise translations. DeepL Translator is an efficient and reliable tool for supporting language communication and meeting translation needs.","link":"https:\/\/www.deepl.com\/translator"},
{"Id":"31","name":"YouTube: Creative Commons","image":"image030.png","description_hu":"A YouTube a világ egyik legnagyobb videómegosztó platformja, amely számos lehetőséget kínál a tartalomkészítőknek és a felhasználóknak. A Creative Commons a YouTube-ban egy funkció, amely lehetővé teszi a tartalomkészítők számára, hogy megadják a videóikhoz alkalmazható licencfeltételeket. A Creative Commons licenc lehetővé teszi a tartalomkészítők számára, hogy engedélyezzék vagy korlátozzák a videóik felhasználását, szerkesztését, másolását és terjesztését. Ez a funkció különösen hasznos azoknak, akik szeretnék megosztani tartalmaikat másokkal, vagy éppen újabb kreatív projektek létrehozásához használni mások videóit. A YouTube Creative Commons lehetősége elősegíti a tartalom megosztását és inspirációt nyújt a felhasználóknak a videók kreatív felhasználásához.","description_en":"YouTube is one of the world's largest video-sharing platforms that offers numerous opportunities for content creators and users. Creative Commons on YouTube is a feature that allows content creators to specify the licensing terms applicable to their videos. The Creative Commons license enables content creators to permit or restrict the use, editing, copying, and distribution of their videos. This feature is particularly useful for those who wish to share their content with others or use videos from others for creating new creative projects. The YouTube Creative Commons option facilitates content sharing and provides inspiration to users for the creative utilization of videos.","link":"https:\/\/www.youtube.com\/watch?v=b7UZELEunow\r\n"},
{"Id":"32","name":"Netlify","image":"image031.png","description_hu":"A Netlify egy felhőalapú webes platform, amely lehetővé teszi a fejlesztők számára, hogy könnyedén és gyorsan készítsenek és üzemeltessenek modern webhelyeket. Ez a platform számos funkciót kínál, beleértve a tartalomkezelést, a tartalom automatikus fordítását, a formákat, az adatbázisokat, az azonosítást és sok másat. A Netlify segít az egyszerű statikus webhelyek létrehozásában, valamint a komplexebb webalkalmazások fejlesztésében és üzemeltetésében. A platform kiváló teljesítményt és skálázhatóságot biztosít, és lehetővé teszi a fejlesztők számára, hogy gyorsan közzétegyék webhelyeiket a világhálón. A Netlify egy hatékony eszköz a webfejlesztéshez, amely segít a gyorsabb és hatékonyabb webhelyek létrehozásában és üzemeltetésében.","description_en":"Netlify is a cloud-based web platform that allows developers to easily and quickly create and deploy modern websites. This platform offers a range of features, including content management, automatic content translation, forms, databases, authentication, and much more. Netlify assists in creating simple static websites as well as developing and hosting more complex web applications. The platform provides excellent performance and scalability, allowing developers to quickly publish their websites on the World Wide Web. Netlify is a powerful tool for web development that helps in creating and deploying websites faster and more efficiently.","link":"https:\/\/www.netlify.com\/"}
]
}
]
